n5/src/Documents/SetupPrices/SetupPrices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SetupPrices</name>
  <basedOn>Document.VendorInvoice</basedOn>
  <registerRecords>InformationRegister.PriceGroups</registerRecords>
  <registerRecords>InformationRegister.Prices</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DateTo</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Simple</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceOrPercent</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ItemsPrices</name>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceGroups</name>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceGroup</name>
      <type>
        <types>CatalogRef.PriceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceGroupsPrices</name>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Enums/Pricing/Pricing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Pricing</name>
  <enumValues>
    <name>Base</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>ItemPercent</name>
  </enumValues>
  <enumValues>
    <name>Group</name>
  </enumValues>
  <enumValues>
    <name>Cost</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/SetupPrices/Forms/Simple/Module.bsl
&AtServer
var Copy;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		Object.Simple = true;
		DocumentForm.Init ( Object );
		Copy = not Parameters.CopyingValue.IsEmpty ();
		if ( not Copy ) then
			loadParams ();
		endif; 
		fillNew ();
	endif; 
	setFilters ();
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	row = Object.Items.Add ();
	row.Item = Parameters.Item;
	
EndProcedure 

&AtServer
Procedure fillNew ()
	
	Object.Date = BegOfDay ( CurrentSessionDate () );
	if ( Object.Date > Object.DateTo ) then
		Object.DateTo = undefined;
	endif; 
	if ( Copy ) then
		return;
	endif;
	settings = Logins.Settings ( "Company" );
	Object.Company = settings.Company;
	Object.Items [ 0 ].Prices = findPrices ();
	setPackage ( ThisObject );
	
EndProcedure 

&AtServer
Function findPrices ()
	
	s = "
	|select top 1 Prices.Ref as Ref
	|from Catalog.Prices as Prices
	|where not Prices.DeletionMark
	|and Prices.Owner = &Company
	|and Prices.Pricing = value ( Enum.Pricing.Base )
	|and Prices.Ref not in ( select CostPrices from Catalog.Companies where Ref = &Company )
	|order by Prices.Code
	|";
	q = new Query ( s );
	q.SetParameter ( "Company", Object.Company );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ].Ref );
	
EndFunction 

&AtClientAtServerNoContext
Procedure setPackage ( Form )
	
	row = Form.Object.Items [ 0 ];
	row.Package = DF.Pick ( row.Item, "Package" );
	
EndProcedure 

&AtServer
Procedure setFilters ()
	
	row = Object.Items [ 0 ];
	a = new Array ();
	a.Add ( new ChoiceParameter ( "Filter.Owner", row.Item ) );
	Items.ItemsPackage.ChoiceParameters = new FixedArray ( a );
	Items.ItemsFeature.ChoiceParameters = new FixedArray ( a );
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure ItemsItemOnChange ( Item )
	
	setPackage ( ThisObject );
	
EndProcedure
